test/request-response-samples/update__complex_extension_fields_in_parent_without_explicit_namespace/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Header></soap:Header><soap:Body><platformMsgs:update xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:record internalId="42" externalId="Alex Dniprovskyy" xsi:type="ns1:Contact" xmlns:ns1="urn:relationships_2013_2.lists.webservices.netsuite.com"><platformCore:nullFieldList xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"><platformCore:name>officephone</platformCore:name></platformCore:nullFieldList><ns1:firstName xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">Allister</ns1:firstName><ns1:lastName xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">Sullivan</ns1:lastName><ns1:phone xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">800-555-2819</ns1:phone></platformMsgs:record></platformMsgs:update></soap:Body></soap:Envelope>