test/request-response-samples/update__complex_extension_with_array_attributes/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Body><platformMsgs:update xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:record internalId="42" externalId="Alex Dniprovskyy" xsi:type="ns1:Contact" xmlns:ns1="urn:relationships_2013_2.lists.webservices.netsuite.com"><ns1:firstName>Allister</ns1:firstName><ns1:lastName>Sullivan</ns1:lastName><platformCore:nullFieldList xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"><platformCore:name>officephone</platformCore:name><platformCore:name>mobilephone</platformCore:name></platformCore:nullFieldList><ns1:phone xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">800-555-2819</ns1:phone><ns1:subscriptionsList xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"><ns1:replaceAll>false</ns1:replaceAll><ns1:subscriptions tempId="34"><ns1:subscribed>true</ns1:subscribed><ns1:subscription internalId="2" xsi:type="platformCore:RecordRef" xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"><platformCore:name>Billing Communication</platformCore:name></ns1:subscription></ns1:subscriptions><ns1:subscriptions><ns1:subscribed>true</ns1:subscribed><ns1:subscription internalId="1" xsi:type="platformCore:RecordRef" xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"><platformCore:name>Marketing</platformCore:name></ns1:subscription></ns1:subscriptions></ns1:subscriptionsList></platformMsgs:record></platformMsgs:update></soap:Body></soap:Envelope>